Ran Plan for 2 projects:

1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
1. project: `services/demoapp/tmcd_apnortheast2` dir: `terraform/services/demoapp/tmcd_apnortheast2` workspace: `default`

### 1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.app_universal will be updated in-place
~ resource "aws_iam_policy" "app_universal" {
        id               = "arn:aws:iam::066346343248:policy/app-universal"
        name             = "app-universal"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::tmc-sample-deployment/demoapp/*",
                          + "arn:aws:s3:::tmc-service-deployment/demoapp/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::tmc-sample-deployment",
                          - "arn:aws:s3:::tmc-sample-deployment/*",
                          + "arn:aws:s3:::tmc-service-deployment",
                          + "arn:aws:s3:::tmc-service-deployment/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "ec2:DescribeInstances",
                            "ec2:DescribeSpotInstanceRequests",
                            "ec2:DescribeTags",
                            "ec2:CreateTags",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "AllowAnsibleCreateDescribeEc2TagsAccess"
                    },
                    # (5 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. project: `services/demoapp/tmcd_apnortheast2` dir: `terraform/services/demoapp/tmcd_apnortheast2` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.demoapp.aws_lb.external will be created
+ resource "aws_lb" "external" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "demoapp-tmcdapne2-ext"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-066f15f574c7f1a3d",
          + "subnet-0a33d6a2708cc9f5c",
        ]
      + tags                                                         = {
          + "Name"    = "demoapp-tmcdapne2-external-lb"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + tags_all                                                     = {
          + "Name"    = "demoapp-tmcdapne2-external-lb"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.demoapp.aws_lb_listener.external_443 will be created
+ resource "aws_lb_listener" "external_443" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-2:066346343248:certificate/10d501d4-a8c8-4358-9996-98060a907e47"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.demoapp.aws_lb_target_group.external will be created
+ resource "aws_lb_target_group" "external" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "0"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "demoapp-tmcdapne2-ext"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "demoapp-tmcdapne2-external-tg"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + tags_all                           = {
          + "Name"    = "demoapp-tmcdapne2-external-tg"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-02bd27f3ad9337b18"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 15
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # module.demoapp.aws_route53_record.external_dns will be created
+ resource "aws_route53_record" "external_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "demoapp"
      + set_identifier  = "ap-northeast-2"
      + type            = "A"
      + zone_id         = "Z09601362JG8MSL8LJAHR"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + latency_routing_policy {
          + region = "ap-northeast-2"
        }
    }

  # module.demoapp.aws_security_group.ec2 will be created
+ resource "aws_security_group" "ec2" {
      + arn                    = (known after apply)
      + description            = "demoapp Instance Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Internal outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Port Open for demoapp"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "demoapp-tmcd_apnortheast2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"  = "demoapp-tmcd_apnortheast2-sg"
          + "app"   = "demoapp"
          + "stack" = "tmcd_apnortheast2"
        }
      + tags_all               = {
          + "Name"  = "demoapp-tmcd_apnortheast2-sg"
          + "app"   = "demoapp"
          + "stack" = "tmcd_apnortheast2"
        }
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

  # module.demoapp.aws_security_group.external_lb will be created
+ resource "aws_security_group" "external_lb" {
      + arn                    = (known after apply)
      + description            = "demoapp external LB SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Internal outbound any traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "121.136.217.18/32",
                ]
              + description      = "External service https port"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "demoapp-tmcd_apnortheast2-ext"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "demoapp-tmcdapne2-external-lb-sg"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + tags_all               = {
          + "Name"    = "demoapp-tmcdapne2-external-lb-sg"
          + "app"     = "demoapp"
          + "env"     = "dev"
          + "project" = "demoapp"
          + "stack"   = "tmcdapne2"
        }
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_security_group_ec2_id = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p services/demoapp/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fservices%252Fdemoapp%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p services/demoapp/tmcd_apnortheast2`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
